Revit 2027 API
ExtElemChangeBeamSectionRegistry.RegisterInterface Method
 Registers a IExtElemChangeBeamSection
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RegisterInterface(
	IExtElemChangeBeamSection provider
)
Public Shared Sub RegisterInterface (
	provider As IExtElemChangeBeamSection
)
public:
static void RegisterInterface(
	IExtElemChangeBeamSection^ provider
)
static member RegisterInterface :
        provider : IExtElemChangeBeamSection -> unit
Parameters
provider IExtElemChangeBeamSection
 IExtElemChangeBeamSection to be registered.
Exceptions
Exception | Condition
ArgumentException |  The provider object is not valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  There is already registered Connections Provider.
See Also
Reference
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace